---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RoomArea
source: html/cc6e7d8c-af55-f4e2-54eb-3143c86180d3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RoomArea Property

"Area"

## Syntax (C#)
```csharp
public static ForgeTypeId RoomArea { get; }
```